### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!   update in-place
-   destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.lambda_function.aws_lambda_function.this[0] will be updated in-place
!   resource "aws_lambda_function" "this" {
        id                             = "authorization"
!       last_modified                  = "2023-08-19T04:28:54.414+0000" -> (known after apply)
!       layers                         = [
-           "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:50",
        ] -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:authorization:1" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:authorization:1/invocations" -> (known after apply)
+       s3_object_version              = "null"
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "1" -> (known after apply)
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] will be destroyed
-   resource "aws_lambda_permission" "current_version_triggers" {
-       action        = "lambda:InvokeFunction" -> null
-       function_name = "authorization" -> null
-       id            = "APIGatewayAny" -> null
-       principal     = "apigateway.amazonaws.com" -> null
-       qualifier     = "1" -> null
-       source_arn    = "arn:aws:execute-api:us-east-1:350131064538:qkcy9ocpg8/*/*" -> null
-       statement_id  = "APIGatewayAny" -> null
    }

  # module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["APIGatewayAny"] will be destroyed
-   resource "aws_lambda_permission" "unqualified_alias_triggers" {
-       action        = "lambda:InvokeFunction" -> null
-       function_name = "authorization" -> null
-       id            = "APIGatewayAny" -> null
-       principal     = "apigateway.amazonaws.com" -> null
-       source_arn    = "arn:aws:execute-api:us-east-1:350131064538:qkcy9ocpg8/*/*" -> null
-       statement_id  = "APIGatewayAny" -> null
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "4560064633722597553" -> (known after apply)
!       triggers = {
!           "timestamp" = "1692419276358364200" -> "1692419802061369000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.aws_lambda_layer_version.this[0] must be replaced
-/+ resource "aws_lambda_layer_version" "this" {
!       arn                         = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:50" -> (known after apply)
-       compatible_architectures    = [] -> null
!       created_date                = "2023-08-19T04:28:43.978+0000" -> (known after apply)
!       id                          = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3:50" -> (known after apply)
!       layer_arn                   = "arn:aws:lambda:us-east-1:350131064538:layer:cataprato-auth-layer-s3" -> (known after apply)
!       s3_key                      = "builds/d6ec1c224ac6663c9e5de61ebef2e3a3a018c32f4673f527bf90e639bf238ec5.zip" -> "builds/093e6b03b51cd60925af24f096bf9cea595775b6584b632f9a37fd5b1916cb30.zip"
!       s3_object_version           = "xsvR032dlScFiSCkk0K.cZEVgrcdVeBf" -> (known after apply)
+       signing_job_arn             = (known after apply)
+       signing_profile_version_arn = (known after apply)
!       source_code_hash            = "wGygv3f7GExa0Z5a2A/yR/cwtk/HSAFhV00rtDvNUBw=" -> (known after apply)
!       source_code_size            = 13452584 -> (known after apply)
!       version                     = "50" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.aws_s3_object.lambda_package[0] must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
!       bucket_key_enabled     = false -> (known after apply)
!       content_type           = "binary/octet-stream" -> (known after apply)
!       etag                   = "f836341b6b8e251a23ed74fb3f04b878-3" -> (known after apply)
!       id                     = "builds/d6ec1c224ac6663c9e5de61ebef2e3a3a018c32f4673f527bf90e639bf238ec5.zip" -> (known after apply)
!       key                    = "builds/d6ec1c224ac6663c9e5de61ebef2e3a3a018c32f4673f527bf90e639bf238ec5.zip" -> "builds/093e6b03b51cd60925af24f096bf9cea595775b6584b632f9a37fd5b1916cb30.zip"
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
!       server_side_encryption = "AES256" -> (known after apply)
!       source                 = "builds/d6ec1c224ac6663c9e5de61ebef2e3a3a018c32f4673f527bf90e639bf238ec5.zip" -> "builds/093e6b03b51cd60925af24f096bf9cea595775b6584b632f9a37fd5b1916cb30.zip"
        tags                   = {
            "Deployment" = "terraform"
        }
!       version_id             = "xsvR032dlScFiSCkk0K.cZEVgrcdVeBf" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_layer_s3.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "zip",
+                       "dist",
+                       null,
                    ],
                ]
+               filename      = "builds/093e6b03b51cd60925af24f096bf9cea595775b6584b632f9a37fd5b1916cb30.zip"
+               runtime       = ""
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/093e6b03b51cd60925af24f096bf9cea595775b6584b632f9a37fd5b1916cb30.plan.json"
+       id                   = (known after apply)
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "7174170651585156673" -> (known after apply)
!       triggers = {
!           "filename"  = "builds/d6ec1c224ac6663c9e5de61ebef2e3a3a018c32f4673f527bf90e639bf238ec5.zip" -> "builds/093e6b03b51cd60925af24f096bf9cea595775b6584b632f9a37fd5b1916cb30.zip"
!           "timestamp" = "1692419277324383000" -> "1692419802997091000"
        }
    }

  # module.lambda_layer_s3.null_resource.sam_metadata_aws_lambda_layer_version[0] must be replaced
-/+ resource "null_resource" "sam_metadata_aws_lambda_layer_version" {
!       id       = "4775430270876011637" -> (known after apply)
!       triggers = {
!           "built_output_path"    = "builds/d6ec1c224ac6663c9e5de61ebef2e3a3a018c32f4673f527bf90e639bf238ec5.zip" -> "builds/093e6b03b51cd60925af24f096bf9cea595775b6584b632f9a37fd5b1916cb30.zip"
            # (4 unchanged elements hidden)
        }
    }

Plan: 6 to add, 1 to change, 7 to destroy.
```
</details>